app/controllers/items_controller.rb

	def index
		respond_with Item.all
---
SELECT `items`.* FROM `items`